Revit 2027 API
ElementArray.ReverseIterator Method
Retrieve a backward moving iterator to the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual ElementArrayIterator ReverseIterator()
Public Overridable Function ReverseIterator As ElementArrayIterator
public:
virtual ElementArrayIterator^ ReverseIterator()
abstract ReverseIterator : unit -> ElementArrayIterator
override ReverseIterator : unit -> ElementArrayIterator
Return Value
ElementArrayIterator
Returns a backward moving iterator to the array.
See Also
Reference
ElementArray Class
Autodesk.Revit.DB Namespace